Revit 2024 API
BeamSystem.BeamType Property
Retrieves or changes the Beam Type of the BeamSystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilySymbol BeamType { get; set; }
Visual Basic
Public Property BeamType As FamilySymbol
	Get
	Set
Visual C++
public:
property FamilySymbol^ BeamType {
	FamilySymbol^ get ();
	void set (FamilySymbol^ value);
}
Examples
CopyC#
public void GetInfo_BeamType(BeamSystem beamSystem)
{
    string message = "BeamSystem : ";
    // Get BeamSystem type name
    message += "\nBeam type name : " + beamSystem.BeamType.Name;
    // Get BeamSystem type material
    foreach (ElementId materialId in beamSystem.BeamType.GetMaterialIds(false))
    {
       Material material = beamSystem.Document.GetElement(materialId) as Material;
       message += "\nBeam type material : " + material.Name;
    }
    // Get BeamSystem family name
    message += "\nBeam family name : " + beamSystem.BeamType.Family.Name;
    // Rename BeamType used by this BeamSystem
    beamSystem.BeamType.Name = "TestBeamTypeName";
    // Rename the Family used by the BeamType that is used by this BeamSystem
    beamSystem.BeamType.Family.Name = "TestBeamTypeFamilyName";
    // Get BeamSystem type name
    message += "\nBeam type name after set : " + beamSystem.BeamType.Name;
    // Get BeamSystem family name
    message += "\nBeam family name after set : " + beamSystem.BeamType.Family.Name;
    TaskDialog.Show("Revit",message);
}
CopyVB.NET
Public Sub GetInfo_BeamType(beamSystem As BeamSystem)
    Dim message As String = "BeamSystem : "
    ' Get BeamSystem type name
    message += vbLf & "Beam type name : " & Convert.ToString(beamSystem.BeamType.Name)
    ' Get BeamSystem type material
    For Each materialId As ElementId In beamSystem.BeamType.GetMaterialIds(False)
        Dim material As Material = TryCast(beamSystem.Document.GetElement(materialId), Material)
        message += vbLf & "Beam type material : " + material.Name
    Next
    ' Get BeamSystem family name
    message += vbLf & "Beam family name : " & Convert.ToString(beamSystem.BeamType.Family.Name)
    ' Rename BeamType used by this BeamSystem
    beamSystem.BeamType.Name = "TestBeamTypeName"
    ' Rename the Family used by the BeamType that is used by this BeamSystem
    beamSystem.BeamType.Family.Name = "TestBeamTypeFamilyName"
    ' Get BeamSystem type name
    message += vbLf & "Beam type name after set : " & Convert.ToString(beamSystem.BeamType.Name)
    ' Get BeamSystem family name
    message += vbLf & "Beam family name after set : " & Convert.ToString(beamSystem.BeamType.Family.Name)
    TaskDialog.Show("Revit", message)
End Sub
See Also
BeamSystem Class
Autodesk.Revit.DB Namespace